CREATE TABLE IF NOT EXISTS public.students
(
    id SERIAL PRIMARY KEY,
    last_name VARCHAR(255),
    first_name VARCHAR(255),
    fathers_name VARCHAR(255),
    birth_date DATE,
    record_book INT
);

INSERT INTO students (last_name, first_name, fathers_name, birth_date, record_book)
VALUES
    ('Петров', 'Іван', 'Олександрович', '2000-05-15', 12345),
    ('Сидоренко', 'Марія', 'Петрівна', '1999-12-03', 67890),
    ('Коваленко', 'Олег', 'Ігорович', '2001-08-20', 54321),
    ('Іванов', 'Олексій', 'Іванович', '1998-01-10', 11111),
    ('Сергієнко', 'Олена', 'Володимирівна', '2002-09-25', 22222),
    ('Михайленко', 'Максим', 'Ігорович', '1997-11-30', 33333),
    ('Ткаченко', 'Анна', 'Василівна', '2003-02-17', 44444),
    ('Павлов', 'Петро', 'Миколайович', '1999-03-08', 55555),
    ('Козлова', 'Ірина', 'Ігорівна', '2000-12-20', 66666),
    ('Данилов', 'Артем', 'Олександрович', '1998-07-14', 77777),
    ('Мартиненко', 'Віктор', 'Андрійович', '2001-03-05', 88888),
    ('Григоренко', 'Олександра', 'Іванівна', '2002-01-12', 99999),
    ('Харченко', 'Юлія', 'Сергіївна', '1999-09-01', 101010),
    ('Соколов', 'Василь', 'Володимирович', '2000-04-24', 111111),
    ('Борисова', 'Тетяна', 'Михайлівна', '1997-08-19', 121212),
    ('Зайцев', 'Максим', 'Андрійович', '2001-11-27', 131313),
    ('Горбунов', 'Олексій', 'Ігорович', '1998-01-07', 141414),
    ('Литвиненко', 'Аліна', 'Олександрівна', '2000-10-30', 151515),
    ('Ігнатенко', 'Олександр', 'Анатолійович', '1999-05-04', 161616),
    ('Дорошенко', 'Ірина', 'Ігорівна', '2002-01-23', 171717);

ALTER TABLE IF EXISTS public.students
    OWNER to postgres;